/**
 * @type {import('typescript/lib/zh-cn/diagnosticMessages.generated.json')}
 */
var msg = {
  "_0_is_declared_but_its_value_is_never_read_6133": "杂鱼~ 明明声明了“{0}”却用都不用，是想白白浪费变量名和占用内存空间罢，只能说大叔写的代码就是这样弱喵😋。",
  "Type_0_is_not_assignable_to_type_1_2322": "杂鱼~ 明明 “{0}” 不可以分配给 “{1}” 却还要强行内设，真是弱喵。",
  "Block_scoped_variable_0_used_before_its_declaration_2448": "有笨蛋在变量“{0}”被声明之前就使用了喵，不被允许的行为却还要强制执行，好丢人喵~",
  "Cannot_find_module_0_or_its_corresponding_type_declarations_2307": "“{0}”是不是没被下载或者没被引入喵，去哪里找都找不到呢~。这可太为难小女子了。",
  "Module_0_has_no_exported_member_1_2305": "杂鱼~ “{0}” 可根本没有导出的成员 “{1}”。大叔是不是导太多键盘都敲不好了❤~",
  "Module_0_has_no_default_export_Did_you_mean_to_use_import_1_from_0_instead_2613": "杂鱼~ 模块 \"{0}\" 明明没有默认导出。要不试试 \"import { {1} } from {0}\"，说不定还能稍微挽救一下这糟糕的代码喵❤~",
  "Module_0_has_no_exported_member_1_Did_you_mean_to_use_import_1_from_0_instead_2614": "杂鱼~ 模块 \"{0}\" 明明没有导出的成员 \"{1}\"。要不试试 \"import {1} from {0}\"，说不定还能稍微挽救一下这糟糕的代码喵❤~",
  "_0_is_declared_here_2728": "\"{0}\" 就...在这里被设入了喵❤~",
  "Cannot_redeclare_block_scoped_variable_0_2451": "笨蛋! “{0}”你怎么敢在同个作用域下多次声明同个名字的变量，连这种低级错误也犯还是去当小女子的 M 吧❤",
  "Cannot_assign_to_0_because_it_is_a_constant_2588": "\"{0}\" 可是个常数哦，为什么还要强行内设别人🥺，难道大叔就喜欢这种玩法吗😰。",
}

module.exports = msg
